stress-test/backend-loadtest.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 20
      arrivalRate: 40
      name: "Warming up"
    - duration: 20
      arrivalRate: 40
      rampTo: 80
      name: "Ramping up"
    - duration: 20
      arrivalRate: 80
      name: "Sustained load"
  processor: "./processor.js"

scenarios:
  - name: "register && login"
    flow:
      - post:
          url: "/register/"
          beforeRequest: generateSignupData
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            visibility: "{{ visibility }}"
      - think: 2
      - post:
          url: "/login/"
          json:
            username: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: $.token
              as: token
      - think: 2